# Функція приймає один параметр: date — рядок, що представляє дату у форматі 'РРРР-ММ-ДД' (наприклад, '2020-10-09').
# Функція повертає ціле число, яке вказує на кількість днів від заданої дати до поточної. Якщо задана дата пізніша за поточну, результат має бути від'ємним.
# У розрахунках необхідно враховувати лише дні, ігноруючи час (години, хвилини, секунди).
# Для роботи з датами слід використовувати модуль datetime Python.

from datetime import datetime

try:
    def dates(date: str) -> int:
        user_input = datetime.strptime(date, "%Y.%m.%d")
        now = datetime.now()
        result = (now - user_input).days
        return result

    # Введіть дату в форматі 'РРРР.ММ.ДД
    result_func = dates("")
    print(f"Минуло {result_func} днів")

except Exception:
    print("Ви вказали невірний формат дати. будь ласка, введіть формат дати з прикладу")