# Функція приймає один параметр: date — рядок, що представляє дату у форматі 'РРРР-ММ-ДД' (наприклад, '2020-10-09').
# Функція повертає ціле число, яке вказує на кількість днів від заданої дати до поточної. Якщо задана дата пізніша за поточну, результат має бути від'ємним.
# У розрахунках необхідно враховувати лише дні, ігноруючи час (години, хвилини, секунди).
# Для роботи з датами слід використовувати модуль datetime Python.

from datetime import datetime

try: 
    def get_days_from_today(date: str) -> int: # Функція приймає параметр у форматі рядка
        date = date.replace("-", ".")
        giv_time = datetime.strptime(date, "%Y.%m.%d") # переводимо рядок-дату в об'єкт datetime
        time_now = datetime.today() # теперішній час 
        result = (time_now - giv_time).days # віднімаємо від теперішнього часу, вказаний час 
        return result # повертаємо результат віднімання 

    # Введіть дату в форматі 'РРРР-ММ-ДД
    result_func = get_days_from_today("2001-12-14") # викликаємо функцію
    print(f"Минуло {result_func} днів") # виводимо результат

except Exception:
    print("Ви вказали невірний формат дати. будь ласка, введіть формат дати з прикладу")